app/controllers/devise/sessions_controller.rb

  def create
    if login()
      @user = User.find_by_email(params[:user][:email])
---
SELECT "users".* FROM "users" WHERE "users"."email" = 'lmj112@ic.ac.uk' LIMIT 1