app/controllers/sessions_controller.rb

  def create
    verified = login()
    puts '*** CREATING NEW SESSION ***'
    user = User.authenticate(params[:user][:login], params[:user][:password])
    # correct credentials
    if login()
      if !user
        user = User.new(params[:user])
        user.save()
---
INSERT INTO "users" ("created_at", "current_sign_in_at", "current_sign_in_ip", "email", "encrypted_password", "last_sign_in_at", "last_sign_in_ip", "login", "password_digest", "remember_created_at", "reset_password_sent_at", "reset_password_token", "session_pass", "sign_in_count", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11, $12, $13, $14, $15) RETURNING "id"